#+title: Emacs config
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

** Darkroom (change margins)
#+begin_src emacs-lisp
(use-package darkroom)
(setq darkroom-text-scale-increase 0)
(setq darkroom-margins 0.20)
(setq darkroom-margin-increment 0.15)
(add-hook 'text-mode-hook (lambda () (interactive) (darkroom-tentative-mode t)))

(defhydra hydra-margin-scale (:timeout 4)
"scale margins"
("j" darkroom-increase-margins "increase")
("k" darkroom-decrease-margins "decrease")
("f" nil "finished" :exit t))

(apollo/leader-keys
"wm" '(hydra-margin-scale/body :which-key "change margins"))
#+end_src

#+RESULTS:
| (lambda nil (interactive) (darkroom-tentative-mode t)) | darkroom-tentative-mode |



